version 1.0;

graph G( input1, input2 ) -> ( output )
{
	input1 = external(shape = [16,16,32,32]);
	filter = constant(shape = [16,1,1,1], value = [1.0]);
	bias = constant(shape = [1,16], value = [0.0]);
	conv = conv(input1, filter, bias, groups = 0);
	input2 = external(shape = [16]);
	output = prelu(conv, input2);
}
