version 1.0;

graph G( input ) -> ( output )
{
	input = external(shape = [4,16,32,32]);
	output = box(input, size = [1,1,3,3], stride = [1,1,2,2], padding = [(0,0), (0,0), (0,0), (0,0)], border = 'constant');
}
