version 1.0;

graph G( input ) -> ( output )
{
	input = external(shape = [4,16,32,32]);
	filter = variable(shape = [16,1,3,3], label = 'filter');
	bias = variable(shape = [1,16], label = 'bias');
	output = conv(input, filter, bias, groups = 0);
}
