version 1.0;

graph G( input ) -> ( output )
{
    input = external(shape = [4,16,32,32]);
    mean = variable(shape = [1,16], label = 'mean');
    variance = variable(shape = [1,16], label = 'variance');
    offset = variable(shape = [1,16], label = 'offset');
    scale = variable(shape = [1,16], label = 'scale');
    output = batch_normalization(input, mean, variance, offset, scale, epsilon = 1e-3);
}
