version 1.0;

graph G( input ) -> ( output )
{
	input = external(shape = [4,8,32,32]);
	plane_filter = variable(shape = [8,1,3,3], label = 'plane_filter');
	point_filter = variable(shape = [16,8,1,1], label = 'point_filter');
	bias = variable(shape = [1,16], label = 'bias');
	output = separable_conv(input, plane_filter, point_filter, bias);
}
