version 1.0;

graph G( input ) -> ( output )
{
	input = external(shape = [4,16,1,1]);
	weights = variable(shape = [32,16], label = 'weights');
	bias = variable(shape = [1,32], label = 'bias');
	squeezed = squeeze(input, axes = [2,3]);
	output = linear(squeezed, weights, bias);
}
