version 1.0;

graph G( input1, input2 ) -> ( output )
{
    input1 = external<scalar>(shape = [4,16]);
    input2 = external<scalar>(shape = [4,16]);
    output = matmul(input1, input2, transposeA = true, transposeB = false);
}
